Docker/Results/Suricata/Fio/results_3.txt
hostname=5b2bfbe8f540, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5b2bfbe8f540> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5b2bfbe8f540> ...
<5b2bfbe8f540> Starting 4 processes
<5b2bfbe8f540> 
write-test: (groupid=0, jobs=1): err= 0: pid=359: Tue Dec 10 17:47:14 2024
  read: IOPS=12.5k, BW=48.6MiB/s (51.0MB/s)(14.2GiB/300001msec)
    slat (nsec): min=1670, max=557853, avg=2767.46, stdev=1723.15
    clat (usec): min=2, max=6106, avg=77.05, stdev=26.75
     lat (usec): min=11, max=6129, avg=79.82, stdev=26.94
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   63], 10.00th=[   67], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   87], 95.00th=[  104],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  217], 99.95th=[  273],
     | 99.99th=[  594]
   bw (  KiB/s): min=44096, max=55888, per=25.02%, avg=49816.52, stdev=1514.25, samples=599
   iops        : min=11024, max=13972, avg=12454.13, stdev=378.56, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=94.57%
  lat (usec)   : 250=5.35%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.56%, sys=5.39%, ctx=3737693, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3735725,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=360: Tue Dec 10 17:47:14 2024
  read: IOPS=12.4k, BW=48.6MiB/s (51.0MB/s)(14.2GiB/300002msec)
    slat (nsec): min=1685, max=548594, avg=2783.96, stdev=1719.35
    clat (nsec): min=1363, max=6200.0k, avg=77100.76, stdev=26791.07
     lat (usec): min=11, max=6218, avg=79.88, stdev=26.97
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   63], 10.00th=[   67], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   87], 95.00th=[  105],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  219], 99.95th=[  277],
     | 99.99th=[  594]
   bw (  KiB/s): min=43600, max=56128, per=24.99%, avg=49772.15, stdev=1536.83, samples=599
   iops        : min=10900, max=14032, avg=12443.04, stdev=384.21, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.52%, 250=5.41%, 500=0.06%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.55%, sys=5.44%, ctx=3734162, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3732258,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=361: Tue Dec 10 17:47:14 2024
  read: IOPS=12.4k, BW=48.6MiB/s (51.0MB/s)(14.2GiB/300001msec)
    slat (nsec): min=1675, max=3425.5k, avg=2779.52, stdev=2469.57
    clat (nsec): min=883, max=6167.2k, avg=77086.04, stdev=26857.98
     lat (usec): min=11, max=6196, avg=79.87, stdev=27.10
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   63], 10.00th=[   67], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   87], 95.00th=[  104],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  219], 99.95th=[  277],
     | 99.99th=[  586]
   bw (  KiB/s): min=43976, max=56208, per=25.00%, avg=49783.45, stdev=1540.06, samples=599
   iops        : min=10994, max=14052, avg=12445.86, stdev=385.02, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=94.54%
  lat (usec)   : 250=5.39%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.55%, sys=5.45%, ctx=3735220, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3733246,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=362: Tue Dec 10 17:47:14 2024
  read: IOPS=12.4k, BW=48.6MiB/s (51.0MB/s)(14.2GiB/300001msec)
    slat (nsec): min=1677, max=593351, avg=2777.87, stdev=1752.23
    clat (nsec): min=1729, max=6105.6k, avg=77065.48, stdev=26759.96
     lat (usec): min=11, max=6124, avg=79.84, stdev=26.94
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   63], 10.00th=[   67], 20.00th=[   72],
     | 30.00th=[   73], 40.00th=[   74], 50.00th=[   74], 60.00th=[   75],
     | 70.00th=[   76], 80.00th=[   79], 90.00th=[   87], 95.00th=[  104],
     | 99.00th=[  141], 99.50th=[  147], 99.90th=[  219], 99.95th=[  281],
     | 99.99th=[  611]
   bw (  KiB/s): min=43688, max=56144, per=25.01%, avg=49798.00, stdev=1535.05, samples=599
   iops        : min=10922, max=14036, avg=12449.50, stdev=383.76, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.56%, 250=5.36%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.52%, sys=5.47%, ctx=3736304, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3734380,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=194MiB/s (204MB/s), 48.6MiB/s-48.6MiB/s (51.0MB/s-51.0MB/s), io=57.0GiB (61.2GB), run=300001-300002msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:47:14 2024
  read: IOPS=49.8k, BW=194Mi (204M)(57.0GiB/300002msec)
    slat (nsec): min=1670, max=3425.5k, avg=2777.20, stdev=1942.56
    clat (nsec): min=883, max=6200.0k, avg=77076.36, stdev=26790.44
     lat (usec): min=11, max=6218, avg=79.85, stdev=26.99
   bw (  KiB/s): min=175360, max=224368, per=25.00%, avg=199170.12, stdev=1530.62, samples=2396
   iops        : min=43840, max=56092, avg=49792.53, stdev=382.66, samples=2396
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=94.55%, 250=5.37%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.55%, sys=5.44%, ctx=14943379, majf=0, minf=53
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14935609,0,0,0 short=0,0,0,0 dropped=0,0,0,0